GopalSaraf/Practicals/PSDL/include/proc/pic16f1765.inc
// Register: MD1CON1
#define MD1CON1 MD1CON1
MD1CON1                                  equ 039Ch
// bitfield definitions
MD1CON1_CLSYNC_POSN                      equ 0000h
MD1CON1_CLSYNC_POSITION                  equ 0000h
MD1CON1_CLSYNC_SIZE                      equ 0001h
MD1CON1_CLSYNC_LENGTH                    equ 0001h
MD1CON1_CLSYNC_MASK                      equ 0001h
MD1CON1_CLPOL_POSN                       equ 0001h
MD1CON1_CLPOL_POSITION                   equ 0001h
MD1CON1_CLPOL_SIZE                       equ 0001h
MD1CON1_CLPOL_LENGTH                     equ 0001h
MD1CON1_CLPOL_MASK                       equ 0002h
MD1CON1_CHSYNC_POSN                      equ 0004h
MD1CON1_CHSYNC_POSITION                  equ 0004h
MD1CON1_CHSYNC_SIZE                      equ 0001h
MD1CON1_CHSYNC_LENGTH                    equ 0001h
MD1CON1_CHSYNC_MASK                      equ 0010h
MD1CON1_CHPOL_POSN                       equ 0005h
MD1CON1_CHPOL_POSITION                   equ 0005h
MD1CON1_CHPOL_SIZE                       equ 0001h
MD1CON1_CHPOL_LENGTH                     equ 0001h
MD1CON1_CHPOL_MASK                       equ 0020h
MD1CON1_MD1CLSYNC_POSN                   equ 0000h
MD1CON1_MD1CLSYNC_POSITION               equ 0000h
MD1CON1_MD1CLSYNC_SIZE                   equ 0001h
MD1CON1_MD1CLSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CLSYNC_MASK                   equ 0001h
MD1CON1_MD1CLPOL_POSN                    equ 0001h
MD1CON1_MD1CLPOL_POSITION                equ 0001h
MD1CON1_MD1CLPOL_SIZE                    equ 0001h
MD1CON1_MD1CLPOL_LENGTH                  equ 0001h
MD1CON1_MD1CLPOL_MASK                    equ 0002h
MD1CON1_MD1CHSYNC_POSN                   equ 0004h
MD1CON1_MD1CHSYNC_POSITION               equ 0004h
MD1CON1_MD1CHSYNC_SIZE                   equ 0001h
MD1CON1_MD1CHSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CHSYNC_MASK                   equ 0010h
MD1CON1_MD1CHPOL_POSN                    equ 0005h
MD1CON1_MD1CHPOL_POSITION                equ 0005h
MD1CON1_MD1CHPOL_SIZE                    equ 0001h
MD1CON1_MD1CHPOL_LENGTH                  equ 0001h
MD1CON1_MD1CHPOL_MASK                    equ 0020h

// Register: MD1SRC
#define MD1SRC MD1SRC
MD1SRC                                   equ 039Dh
// bitfield definitions
MD1SRC_MS_POSN                           equ 0000h
MD1SRC_MS_POSITION                       equ 0000h
MD1SRC_MS_SIZE                           equ 0005h
MD1SRC_MS_LENGTH                         equ 0005h
MD1SRC_MS_MASK                           equ 001Fh
MD1SRC_MS0_POSN                          equ 0000h
MD1SRC_MS0_POSITION                      equ 0000h
MD1SRC_MS0_SIZE                          equ 0001h
MD1SRC_MS0_LENGTH                        equ 0001h
MD1SRC_MS0_MASK                          equ 0001h
MD1SRC_MS1_POSN                          equ 0001h
MD1SRC_MS1_POSITION                      equ 0001h
MD1SRC_MS1_SIZE                          equ 0001h
MD1SRC_MS1_LENGTH                        equ 0001h
MD1SRC_MS1_MASK                          equ 0002h
MD1SRC_MS2_POSN                          equ 0002h
MD1SRC_MS2_POSITION                      equ 0002h
MD1SRC_MS2_SIZE                          equ 0001h
MD1SRC_MS2_LENGTH                        equ 0001h
MD1SRC_MS2_MASK                          equ 0004h
MD1SRC_MS3_POSN                          equ 0003h
MD1SRC_MS3_POSITION                      equ 0003h
MD1SRC_MS3_SIZE                          equ 0001h
MD1SRC_MS3_LENGTH                        equ 0001h
MD1SRC_MS3_MASK                          equ 0008h
MD1SRC_MS4_POSN                          equ 0004h
MD1SRC_MS4_POSITION                      equ 0004h
MD1SRC_MS4_SIZE                          equ 0001h
MD1SRC_MS4_LENGTH                        equ 0001h
MD1SRC_MS4_MASK                          equ 0010h
MD1SRC_MD1MS_POSN                        equ 0000h
MD1SRC_MD1MS_POSITION                    equ 0000h
MD1SRC_MD1MS_SIZE                        equ 0005h
MD1SRC_MD1MS_LENGTH                      equ 0005h
MD1SRC_MD1MS_MASK                        equ 001Fh
MD1SRC_MD1MS0_POSN                       equ 0000h
MD1SRC_MD1MS0_POSITION                   equ 0000h
MD1SRC_MD1MS0_SIZE                       equ 0001h
MD1SRC_MD1MS0_LENGTH                     equ 0001h
MD1SRC_MD1MS0_MASK                       equ 0001h
MD1SRC_MD1MS1_POSN                       equ 0001h
MD1SRC_MD1MS1_POSITION                   equ 0001h
MD1SRC_MD1MS1_SIZE                       equ 0001h
MD1SRC_MD1MS1_LENGTH                     equ 0001h
MD1SRC_MD1MS1_MASK                       equ 0002h
MD1SRC_MD1MS2_POSN                       equ 0002h
MD1SRC_MD1MS2_POSITION                   equ 0002h
MD1SRC_MD1MS2_SIZE                       equ 0001h
MD1SRC_MD1MS2_LENGTH                     equ 0001h
MD1SRC_MD1MS2_MASK                       equ 0004h
MD1SRC_MD1MS3_POSN                       equ 0003h
MD1SRC_MD1MS3_POSITION                   equ 0003h
MD1SRC_MD1MS3_SIZE                       equ 0001h
MD1SRC_MD1MS3_LENGTH                     equ 0001h
MD1SRC_MD1MS3_MASK                       equ 0008h
MD1SRC_MD1MS4_POSN                       equ 0004h
MD1SRC_MD1MS4_POSITION                   equ 0004h
MD1SRC_MD1MS4_SIZE                       equ 0001h
MD1SRC_MD1MS4_LENGTH                     equ 0001h
MD1SRC_MD1MS4_MASK                       equ 0010h

// Register: MD1CARL
#define MD1CARL MD1CARL
MD1CARL                                  equ 039Eh
// bitfield definitions
MD1CARL_CL_POSN                          equ 0000h
MD1CARL_CL_POSITION                      equ 0000h
MD1CARL_CL_SIZE                          equ 0004h
MD1CARL_CL_LENGTH                        equ 0004h
MD1CARL_CL_MASK                          equ 000Fh
MD1CARL_CL0_POSN                         equ 0000h
MD1CARL_CL0_POSITION                     equ 0000h
MD1CARL_CL0_SIZE                         equ 0001h
MD1CARL_CL0_LENGTH                       equ 0001h
MD1CARL_CL0_MASK                         equ 0001h
MD1CARL_CL1_POSN                         equ 0001h
MD1CARL_CL1_POSITION                     equ 0001h
MD1CARL_CL1_SIZE                         equ 0001h
MD1CARL_CL1_LENGTH                       equ 0001h
MD1CARL_CL1_MASK                         equ 0002h
MD1CARL_CL2_POSN                         equ 0002h
MD1CARL_CL2_POSITION                     equ 0002h
MD1CARL_CL2_SIZE                         equ 0001h
MD1CARL_CL2_LENGTH                       equ 0001h
MD1CARL_CL2_MASK                         equ 0004h
MD1CARL_CL3_POSN                         equ 0003h
MD1CARL_CL3_POSITION                     equ 0003h
MD1CARL_CL3_SIZE                         equ 0001h
MD1CARL_CL3_LENGTH                       equ 0001h
MD1CARL_CL3_MASK                         equ 0008h
MD1CARL_MD1CL_POSN                       equ 0000h
MD1CARL_MD1CL_POSITION                   equ 0000h
MD1CARL_MD1CL_SIZE                       equ 0004h
MD1CARL_MD1CL_LENGTH                     equ 0004h
MD1CARL_MD1CL_MASK                       equ 000Fh
MD1CARL_MD1CL0_POSN                      equ 0000h
MD1CARL_MD1CL0_POSITION                  equ 0000h
MD1CARL_MD1CL0_SIZE                      equ 0001h
MD1CARL_MD1CL0_LENGTH                    equ 0001h
MD1CARL_MD1CL0_MASK                      equ 0001h
MD1CARL_MD1CL1_POSN                      equ 0001h
MD1CARL_MD1CL1_POSITION                  equ 0001h
MD1CARL_MD1CL1_SIZE                      equ 0001h
MD1CARL_MD1CL1_LENGTH                    equ 0001h
MD1CARL_MD1CL1_MASK                      equ 0002h
MD1CARL_MD1CL2_POSN                      equ 0002h
MD1CARL_MD1CL2_POSITION                  equ 0002h
MD1CARL_MD1CL2_SIZE                      equ 0001h
MD1CARL_MD1CL2_LENGTH                    equ 0001h
MD1CARL_MD1CL2_MASK                      equ 0004h
MD1CARL_MD1CL3_POSN                      equ 0003h
MD1CARL_MD1CL3_POSITION                  equ 0003h
MD1CARL_MD1CL3_SIZE                      equ 0001h
MD1CARL_MD1CL3_LENGTH                    equ 0001h
MD1CARL_MD1CL3_MASK                      equ 0008h

// Register: MD1CARH
#define MD1CARH MD1CARH
MD1CARH                                  equ 039Fh
// bitfield definitions
MD1CARH_CH_POSN                          equ 0000h
MD1CARH_CH_POSITION                      equ 0000h
MD1CARH_CH_SIZE                          equ 0004h
MD1CARH_CH_LENGTH                        equ 0004h
MD1CARH_CH_MASK                          equ 000Fh
MD1CARH_CH0_POSN                         equ 0000h
MD1CARH_CH0_POSITION                     equ 0000h
MD1CARH_CH0_SIZE                         equ 0001h
MD1CARH_CH0_LENGTH                       equ 0001h
MD1CARH_CH0_MASK                         equ 0001h
MD1CARH_CH1_POSN                         equ 0001h
MD1CARH_CH1_POSITION                     equ 0001h
MD1CARH_CH1_SIZE                         equ 0001h
MD1CARH_CH1_LENGTH                       equ 0001h
MD1CARH_CH1_MASK                         equ 0002h
MD1CARH_CH2_POSN                         equ 0002h
MD1CARH_CH2_POSITION                     equ 0002h
MD1CARH_CH2_SIZE                         equ 0001h
MD1CARH_CH2_LENGTH                       equ 0001h
MD1CARH_CH2_MASK                         equ 0004h
MD1CARH_CH3_POSN                         equ 0003h
MD1CARH_CH3_POSITION                     equ 0003h
MD1CARH_CH3_SIZE                         equ 0001h
MD1CARH_CH3_LENGTH                       equ 0001h
MD1CARH_CH3_MASK                         equ 0008h
MD1CARH_MD1CH_POSN                       equ 0000h
MD1CARH_MD1CH_POSITION                   equ 0000h
MD1CARH_MD1CH_SIZE                       equ 0004h
MD1CARH_MD1CH_LENGTH                     equ 0004h
MD1CARH_MD1CH_MASK                       equ 000Fh
MD1CARH_MD1CH0_POSN                      equ 0000h
MD1CARH_MD1CH0_POSITION                  equ 0000h
MD1CARH_MD1CH0_SIZE                      equ 0001h
MD1CARH_MD1CH0_LENGTH                    equ 0001h
MD1CARH_MD1CH0_MASK                      equ 0001h
MD1CARH_MD1CH1_POSN                      equ 0001h
MD1CARH_MD1CH1_POSITION                  equ 0001h
MD1CARH_MD1CH1_SIZE                      equ 0001h
MD1CARH_MD1CH1_LENGTH                    equ 0001h
MD1CARH_MD1CH1_MASK                      equ 0002h
MD1CARH_MD1CH2_POSN                      equ 0002h
MD1CARH_MD1CH2_POSITION                  equ 0002h
MD1CARH_MD1CH2_SIZE                      equ 0001h
MD1CARH_MD1CH2_LENGTH                    equ 0001h
MD1CARH_MD1CH2_MASK                      equ 0004h
MD1CARH_MD1CH3_POSN                      equ 0003h
MD1CARH_MD1CH3_POSITION                  equ 0003h
MD1CARH_MD1CH3_SIZE                      equ 0001h
MD1CARH_MD1CH3_LENGTH                    equ 0001h
MD1CARH_MD1CH3_MASK                      equ 0008h

// Register: HIDRVC
#define HIDRVC HIDRVC
HIDRVC                                   equ 040Eh
// bitfield definitions
HIDRVC_HIDC4_POSN                        equ 0004h
HIDRVC_HIDC4_POSITION                    equ 0004h
HIDRVC_HIDC4_SIZE                        equ 0001h
HIDRVC_HIDC4_LENGTH                      equ 0001h
HIDRVC_HIDC4_MASK                        equ 0010h
HIDRVC_HIDC5_POSN                        equ 0005h
HIDRVC_HIDC5_POSITION                    equ 0005h
HIDRVC_HIDC5_SIZE                        equ 0001h
HIDRVC_HIDC5_LENGTH                      equ 0001h
HIDRVC_HIDC5_MASK                        equ 0020h

// Register: T4TMR
#define T4TMR T4TMR
T4TMR                                    equ 0413h
// bitfield definitions
T4TMR_TMR_POSN                           equ 0000h
T4TMR_TMR_POSITION                       equ 0000h
T4TMR_TMR_SIZE                           equ 0008h
T4TMR_TMR_LENGTH                         equ 0008h
T4TMR_TMR_MASK                           equ 00FFh
T4TMR_TMR4_POSN                          equ 0000h
T4TMR_TMR4_POSITION                      equ 0000h
T4TMR_TMR4_SIZE                          equ 0008h
T4TMR_TMR4_LENGTH                        equ 0008h
T4TMR_TMR4_MASK                          equ 00FFh

// Register: T4PR
#define T4PR T4PR
T4PR                                     equ 0414h
// bitfield definitions
T4PR_PR_POSN                             equ 0000h
T4PR_PR_POSITION                         equ 0000h
T4PR_PR_SIZE                             equ 0008h
T4PR_PR_LENGTH                           equ 0008h
T4PR_PR_MASK                             equ 00FFh
T4PR_T4PR_POSN                           equ 0000h
T4PR_T4PR_POSITION                       equ 0000h
T4PR_T4PR_SIZE                           equ 0008h
T4PR_T4PR_LENGTH                         equ 0008h
T4PR_T4PR_MASK                           equ 00FFh

// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 0415h
// bitfield definitions
T4CON_OUTPS_POSN                         equ 0000h
T4CON_OUTPS_POSITION                     equ 0000h
T4CON_OUTPS_SIZE                         equ 0004h
T4CON_OUTPS_LENGTH                       equ 0004h
T4CON_OUTPS_MASK                         equ 000Fh
T4CON_CKPS_POSN                          equ 0004h
T4CON_CKPS_POSITION                      equ 0004h
T4CON_CKPS_SIZE                          equ 0003h
T4CON_CKPS_LENGTH                        equ 0003h
T4CON_CKPS_MASK                          equ 0070h
T4CON_ON_POSN                            equ 0007h
T4CON_ON_POSITION                        equ 0007h
T4CON_ON_SIZE                            equ 0001h
T4CON_ON_LENGTH                          equ 0001h
T4CON_ON_MASK                            equ 0080h
T4CON_OUTPS0_POSN                        equ 0000h
T4CON_OUTPS0_POSITION                    equ 0000h
T4CON_OUTPS0_SIZE                        equ 0001h
T4CON_OUTPS0_LENGTH                      equ 0001h
T4CON_OUTPS0_MASK                        equ 0001h
T4CON_OUTPS1_POSN                        equ 0001h
T4CON_OUTPS1_POSITION                    equ 0001h
T4CON_OUTPS1_SIZE                        equ 0001h
T4CON_OUTPS1_LENGTH                      equ 0001h
T4CON_OUTPS1_MASK                        equ 0002h
T4CON_OUTPS2_POSN                        equ 0002h
T4CON_OUTPS2_POSITION                    equ 0002h
T4CON_OUTPS2_SIZE                        equ 0001h
T4CON_OUTPS2_LENGTH                      equ 0001h
T4CON_OUTPS2_MASK                        equ 0004h
T4CON_OUTPS3_POSN                        equ 0003h
T4CON_OUTPS3_POSITION                    equ 0003h
T4CON_OUTPS3_SIZE                        equ 0001h
T4CON_OUTPS3_LENGTH                      equ 0001h
T4CON_OUTPS3_MASK                        equ 0008h
T4CON_CKPS0_POSN                         equ 0004h
T4CON_CKPS0_POSITION                     equ 0004h
T4CON_CKPS0_SIZE                         equ 0001h
T4CON_CKPS0_LENGTH                       equ 0001h
T4CON_CKPS0_MASK                         equ 0010h
T4CON_CKPS1_POSN                         equ 0005h
T4CON_CKPS1_POSITION                     equ 0005h
T4CON_CKPS1_SIZE                         equ 0001h
T4CON_CKPS1_LENGTH                       equ 0001h
T4CON_CKPS1_MASK                         equ 0020h
T4CON_CKPS2_POSN                         equ 0006h
T4CON_CKPS2_POSITION                     equ 0006h
T4CON_CKPS2_SIZE                         equ 0001h
T4CON_CKPS2_LENGTH                       equ 0001h
T4CON_CKPS2_MASK                         equ 0040h
T4CON_T4OUTPS_POSN                       equ 0000h
T4CON_T4OUTPS_POSITION                   equ 0000h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 000Fh
T4CON_T4CKPS_POSN                        equ 0004h
T4CON_T4CKPS_POSITION                    equ 0004h
T4CON_T4CKPS_SIZE                        equ 0003h
T4CON_T4CKPS_LENGTH                      equ 0003h
T4CON_T4CKPS_MASK                        equ 0070h
T4CON_T4ON_POSN                          equ 0007h
T4CON_T4ON_POSITION                      equ 0007h
T4CON_T4ON_SIZE                          equ 0001h
T4CON_T4ON_LENGTH                        equ 0001h
T4CON_T4ON_MASK                          equ 0080h
T4CON_T4OUTPS0_POSN                      equ 0000h
T4CON_T4OUTPS0_POSITION                  equ 0000h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0001h
T4CON_T4OUTPS1_POSN                      equ 0001h
T4CON_T4OUTPS1_POSITION                  equ 0001h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0002h
T4CON_T4OUTPS2_POSN                      equ 0002h
T4CON_T4OUTPS2_POSITION                  equ 0002h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0004h
T4CON_T4OUTPS3_POSN                      equ 0003h
T4CON_T4OUTPS3_POSITION                  equ 0003h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0008h
T4CON_T4CKPS0_POSN                       equ 0004h
T4CON_T4CKPS0_POSITION                   equ 0004h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0010h
T4CON_T4CKPS1_POSN                       equ 0005h
T4CON_T4CKPS1_POSITION                   equ 0005h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0020h
T4CON_T4CKPS2_POSN                       equ 0006h
T4CON_T4CKPS2_POSITION                   equ 0006h
T4CON_T4CKPS2_SIZE                       equ 0001h
T4CON_T4CKPS2_LENGTH                     equ 0001h
T4CON_T4CKPS2_MASK                       equ 0040h
T4CON_TMR4ON_POSN                        equ 0007h
T4CON_TMR4ON_POSITION                    equ 0007h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0080h

// Register: T4HLT
#define T4HLT T4HLT
T4HLT                                    equ 0416h
// bitfield definitions
T4HLT_MODE_POSN                          equ 0000h
T4HLT_MODE_POSITION                      equ 0000h
T4HLT_MODE_SIZE                          equ 0005h
T4HLT_MODE_LENGTH                        equ 0005h
T4HLT_MODE_MASK                          equ 001Fh
T4HLT_CKSYNC_POSN                        equ 0005h
T4HLT_CKSYNC_POSITION                    equ 0005h
T4HLT_CKSYNC_SIZE                        equ 0001h
T4HLT_CKSYNC_LENGTH                      equ 0001h
T4HLT_CKSYNC_MASK                        equ 0020h
T4HLT_CKPOL_POSN                         equ 0006h
T4HLT_CKPOL_POSITION                     equ 0006h
T4HLT_CKPOL_SIZE                         equ 0001h
T4HLT_CKPOL_LENGTH                       equ 0001h
T4HLT_CKPOL_MASK                         equ 0040h
T4HLT_PSYNC_POSN                         equ 0007h
T4HLT_PSYNC_POSITION                     equ 0007h
T4HLT_PSYNC_SIZE                         equ 0001h
T4HLT_PSYNC_LENGTH                       equ 0001h
T4HLT_PSYNC_MASK                         equ 0080h
T4HLT_MODE0_POSN                         equ 0000h
T4HLT_MODE0_POSITION                     equ 0000h
T4HLT_MODE0_SIZE                         equ 0001h
T4HLT_MODE0_LENGTH                       equ 0001h
T4HLT_MODE0_MASK                         equ 0001h
T4HLT_MODE1_POSN                         equ 0001h
T4HLT_MODE1_POSITION                     equ 0001h
T4HLT_MODE1_SIZE                         equ 0001h
T4HLT_MODE1_LENGTH                       equ 0001h
T4HLT_MODE1_MASK                         equ 0002h
T4HLT_MODE2_POSN                         equ 0002h
T4HLT_MODE2_POSITION                     equ 0002h
T4HLT_MODE2_SIZE                         equ 0001h
T4HLT_MODE2_LENGTH                       equ 0001h
T4HLT_MODE2_MASK                         equ 0004h
T4HLT_MODE3_POSN                         equ 0003h
T4HLT_MODE3_POSITION                     equ 0003h
T4HLT_MODE3_SIZE                         equ 0001h
T4HLT_MODE3_LENGTH                       equ 0001h
T4HLT_MODE3_MASK                         equ 0008h
T4HLT_MODE4_POSN                         equ 0004h
T4HLT_MODE4_POSITION                     equ 0004h
T4HLT_MODE4_SIZE                         equ 0001h
T4HLT_MODE4_LENGTH                       equ 0001h
T4HLT_MODE4_MASK                         equ 0010h
T4HLT_T4MODE_POSN                        equ 0000h
T4HLT_T4MODE_POSITION                    equ 0000h
T4HLT_T4MODE_SIZE                        equ 0005h
T4HLT_T4MODE_LENGTH                      equ 0005h
T4HLT_T4MODE_MASK                        equ 001Fh
T4HLT_T4CKSYNC_POSN                      equ 0005h
T4HLT_T4CKSYNC_POSITION                  equ 0005h
T4HLT_T4CKSYNC_SIZE                      equ 0001h
T4HLT_T4CKSYNC_LENGTH                    equ 0001h
T4HLT_T4CKSYNC_MASK                      equ 0020h
T4HLT_T4CKPOL_POSN                       equ 0006h
T4HLT_T4CKPOL_POSITION                   equ 0006h
T4HLT_T4CKPOL_SIZE                       equ 0001h
T4HLT_T4CKPOL_LENGTH                     equ 0001h
T4HLT_T4CKPOL_MASK                       equ 0040h
T4HLT_T4PSYNC_POSN                       equ 0007h
T4HLT_T4PSYNC_POSITION                   equ 0007h
T4HLT_T4PSYNC_SIZE                       equ 0001h
T4HLT_T4PSYNC_LENGTH                     equ 0001h
T4HLT_T4PSYNC_MASK                       equ 0080h
T4HLT_T4MODE0_POSN                       equ 0000h
T4HLT_T4MODE0_POSITION                   equ 0000h
T4HLT_T4MODE0_SIZE                       equ 0001h
T4HLT_T4MODE0_LENGTH                     equ 0001h
T4HLT_T4MODE0_MASK                       equ 0001h
T4HLT_T4MODE1_POSN                       equ 0001h
T4HLT_T4MODE1_POSITION                   equ 0001h
T4HLT_T4MODE1_SIZE                       equ 0001h
T4HLT_T4MODE1_LENGTH                     equ 0001h
T4HLT_T4MODE1_MASK                       equ 0002h
T4HLT_T4MODE2_POSN                       equ 0002h
T4HLT_T4MODE2_POSITION                   equ 0002h
T4HLT_T4MODE2_SIZE                       equ 0001h
T4HLT_T4MODE2_LENGTH                     equ 0001h
T4HLT_T4MODE2_MASK                       equ 0004h
T4HLT_T4MODE3_POSN                       equ 0003h
T4HLT_T4MODE3_POSITION                   equ 0003h
T4HLT_T4MODE3_SIZE                       equ 0001h
T4HLT_T4MODE3_LENGTH                     equ 0001h
T4HLT_T4MODE3_MASK                       equ 0008h
T4HLT_T4MODE4_POSN                       equ 0004h
T4HLT_T4MODE4_POSITION                   equ 0004h
T4HLT_T4MODE4_SIZE                       equ 0001h
T4HLT_T4MODE4_LENGTH                     equ 0001h
T4HLT_T4MODE4_MASK                       equ 0010h

