GopalSaraf/Practicals/PSDL/include/proc/pic16f1765.inc
// Register: PRG1CON0
#define PRG1CON0 PRG1CON0
PRG1CON0                                 equ 0797h
// bitfield definitions
PRG1CON0_GO_POSN                         equ 0000h
PRG1CON0_GO_POSITION                     equ 0000h
PRG1CON0_GO_SIZE                         equ 0001h
PRG1CON0_GO_LENGTH                       equ 0001h
PRG1CON0_GO_MASK                         equ 0001h
PRG1CON0_OS_POSN                         equ 0001h
PRG1CON0_OS_POSITION                     equ 0001h
PRG1CON0_OS_SIZE                         equ 0001h
PRG1CON0_OS_LENGTH                       equ 0001h
PRG1CON0_OS_MASK                         equ 0002h
PRG1CON0_MODE_POSN                       equ 0002h
PRG1CON0_MODE_POSITION                   equ 0002h
PRG1CON0_MODE_SIZE                       equ 0002h
PRG1CON0_MODE_LENGTH                     equ 0002h
PRG1CON0_MODE_MASK                       equ 000Ch
PRG1CON0_REDG_POSN                       equ 0004h
PRG1CON0_REDG_POSITION                   equ 0004h
PRG1CON0_REDG_SIZE                       equ 0001h
PRG1CON0_REDG_LENGTH                     equ 0001h
PRG1CON0_REDG_MASK                       equ 0010h
PRG1CON0_FEDG_POSN                       equ 0005h
PRG1CON0_FEDG_POSITION                   equ 0005h
PRG1CON0_FEDG_SIZE                       equ 0001h
PRG1CON0_FEDG_LENGTH                     equ 0001h
PRG1CON0_FEDG_MASK                       equ 0020h
PRG1CON0_EN_POSN                         equ 0007h
PRG1CON0_EN_POSITION                     equ 0007h
PRG1CON0_EN_SIZE                         equ 0001h
PRG1CON0_EN_LENGTH                       equ 0001h
PRG1CON0_EN_MASK                         equ 0080h
PRG1CON0_MODE0_POSN                      equ 0002h
PRG1CON0_MODE0_POSITION                  equ 0002h
PRG1CON0_MODE0_SIZE                      equ 0001h
PRG1CON0_MODE0_LENGTH                    equ 0001h
PRG1CON0_MODE0_MASK                      equ 0004h
PRG1CON0_MODE1_POSN                      equ 0003h
PRG1CON0_MODE1_POSITION                  equ 0003h
PRG1CON0_MODE1_SIZE                      equ 0001h
PRG1CON0_MODE1_LENGTH                    equ 0001h
PRG1CON0_MODE1_MASK                      equ 0008h
PRG1CON0_RG1GO_POSN                      equ 0000h
PRG1CON0_RG1GO_POSITION                  equ 0000h
PRG1CON0_RG1GO_SIZE                      equ 0001h
PRG1CON0_RG1GO_LENGTH                    equ 0001h
PRG1CON0_RG1GO_MASK                      equ 0001h
PRG1CON0_RG1OS_POSN                      equ 0001h
PRG1CON0_RG1OS_POSITION                  equ 0001h
PRG1CON0_RG1OS_SIZE                      equ 0001h
PRG1CON0_RG1OS_LENGTH                    equ 0001h
PRG1CON0_RG1OS_MASK                      equ 0002h
PRG1CON0_RG1MODE_POSN                    equ 0002h
PRG1CON0_RG1MODE_POSITION                equ 0002h
PRG1CON0_RG1MODE_SIZE                    equ 0002h
PRG1CON0_RG1MODE_LENGTH                  equ 0002h
PRG1CON0_RG1MODE_MASK                    equ 000Ch
PRG1CON0_RG1REDG_POSN                    equ 0004h
PRG1CON0_RG1REDG_POSITION                equ 0004h
PRG1CON0_RG1REDG_SIZE                    equ 0001h
PRG1CON0_RG1REDG_LENGTH                  equ 0001h
PRG1CON0_RG1REDG_MASK                    equ 0010h
PRG1CON0_RG1FEDG_POSN                    equ 0005h
PRG1CON0_RG1FEDG_POSITION                equ 0005h
PRG1CON0_RG1FEDG_SIZE                    equ 0001h
PRG1CON0_RG1FEDG_LENGTH                  equ 0001h
PRG1CON0_RG1FEDG_MASK                    equ 0020h
PRG1CON0_RG1EN_POSN                      equ 0007h
PRG1CON0_RG1EN_POSITION                  equ 0007h
PRG1CON0_RG1EN_SIZE                      equ 0001h
PRG1CON0_RG1EN_LENGTH                    equ 0001h
PRG1CON0_RG1EN_MASK                      equ 0080h
PRG1CON0_RG1MODE0_POSN                   equ 0002h
PRG1CON0_RG1MODE0_POSITION               equ 0002h
PRG1CON0_RG1MODE0_SIZE                   equ 0001h
PRG1CON0_RG1MODE0_LENGTH                 equ 0001h
PRG1CON0_RG1MODE0_MASK                   equ 0004h
PRG1CON0_RG1MODE1_POSN                   equ 0003h
PRG1CON0_RG1MODE1_POSITION               equ 0003h
PRG1CON0_RG1MODE1_SIZE                   equ 0001h
PRG1CON0_RG1MODE1_LENGTH                 equ 0001h
PRG1CON0_RG1MODE1_MASK                   equ 0008h

// Register: PRG1CON1
#define PRG1CON1 PRG1CON1
PRG1CON1                                 equ 0798h
// bitfield definitions
PRG1CON1_RPOL_POSN                       equ 0000h
PRG1CON1_RPOL_POSITION                   equ 0000h
PRG1CON1_RPOL_SIZE                       equ 0001h
PRG1CON1_RPOL_LENGTH                     equ 0001h
PRG1CON1_RPOL_MASK                       equ 0001h
PRG1CON1_FPOL_POSN                       equ 0001h
PRG1CON1_FPOL_POSITION                   equ 0001h
PRG1CON1_FPOL_SIZE                       equ 0001h
PRG1CON1_FPOL_LENGTH                     equ 0001h
PRG1CON1_FPOL_MASK                       equ 0002h
PRG1CON1_RDY_POSN                        equ 0002h
PRG1CON1_RDY_POSITION                    equ 0002h
PRG1CON1_RDY_SIZE                        equ 0001h
PRG1CON1_RDY_LENGTH                      equ 0001h
PRG1CON1_RDY_MASK                        equ 0004h
PRG1CON1_RG1RPOL_POSN                    equ 0000h
PRG1CON1_RG1RPOL_POSITION                equ 0000h
PRG1CON1_RG1RPOL_SIZE                    equ 0001h
PRG1CON1_RG1RPOL_LENGTH                  equ 0001h
PRG1CON1_RG1RPOL_MASK                    equ 0001h
PRG1CON1_RG1FPOL_POSN                    equ 0001h
PRG1CON1_RG1FPOL_POSITION                equ 0001h
PRG1CON1_RG1FPOL_SIZE                    equ 0001h
PRG1CON1_RG1FPOL_LENGTH                  equ 0001h
PRG1CON1_RG1FPOL_MASK                    equ 0002h
PRG1CON1_RG1RDY_POSN                     equ 0002h
PRG1CON1_RG1RDY_POSITION                 equ 0002h
PRG1CON1_RG1RDY_SIZE                     equ 0001h
PRG1CON1_RG1RDY_LENGTH                   equ 0001h
PRG1CON1_RG1RDY_MASK                     equ 0004h

// Register: PRG1CON2
#define PRG1CON2 PRG1CON2
PRG1CON2                                 equ 0799h
// bitfield definitions
PRG1CON2_ISET_POSN                       equ 0000h
PRG1CON2_ISET_POSITION                   equ 0000h
PRG1CON2_ISET_SIZE                       equ 0005h
PRG1CON2_ISET_LENGTH                     equ 0005h
PRG1CON2_ISET_MASK                       equ 001Fh
PRG1CON2_ISET0_POSN                      equ 0000h
PRG1CON2_ISET0_POSITION                  equ 0000h
PRG1CON2_ISET0_SIZE                      equ 0001h
PRG1CON2_ISET0_LENGTH                    equ 0001h
PRG1CON2_ISET0_MASK                      equ 0001h
PRG1CON2_ISET1_POSN                      equ 0001h
PRG1CON2_ISET1_POSITION                  equ 0001h
PRG1CON2_ISET1_SIZE                      equ 0001h
PRG1CON2_ISET1_LENGTH                    equ 0001h
PRG1CON2_ISET1_MASK                      equ 0002h
PRG1CON2_ISET2_POSN                      equ 0002h
PRG1CON2_ISET2_POSITION                  equ 0002h
PRG1CON2_ISET2_SIZE                      equ 0001h
PRG1CON2_ISET2_LENGTH                    equ 0001h
PRG1CON2_ISET2_MASK                      equ 0004h
PRG1CON2_ISET3_POSN                      equ 0003h
PRG1CON2_ISET3_POSITION                  equ 0003h
PRG1CON2_ISET3_SIZE                      equ 0001h
PRG1CON2_ISET3_LENGTH                    equ 0001h
PRG1CON2_ISET3_MASK                      equ 0008h
PRG1CON2_ISET4_POSN                      equ 0004h
PRG1CON2_ISET4_POSITION                  equ 0004h
PRG1CON2_ISET4_SIZE                      equ 0001h
PRG1CON2_ISET4_LENGTH                    equ 0001h
PRG1CON2_ISET4_MASK                      equ 0010h
PRG1CON2_RG1ISET_POSN                    equ 0000h
PRG1CON2_RG1ISET_POSITION                equ 0000h
PRG1CON2_RG1ISET_SIZE                    equ 0005h
PRG1CON2_RG1ISET_LENGTH                  equ 0005h
PRG1CON2_RG1ISET_MASK                    equ 001Fh
PRG1CON2_RG1ISET0_POSN                   equ 0000h
PRG1CON2_RG1ISET0_POSITION               equ 0000h
PRG1CON2_RG1ISET0_SIZE                   equ 0001h
PRG1CON2_RG1ISET0_LENGTH                 equ 0001h
PRG1CON2_RG1ISET0_MASK                   equ 0001h
PRG1CON2_RG1ISET1_POSN                   equ 0001h
PRG1CON2_RG1ISET1_POSITION               equ 0001h
PRG1CON2_RG1ISET1_SIZE                   equ 0001h
PRG1CON2_RG1ISET1_LENGTH                 equ 0001h
PRG1CON2_RG1ISET1_MASK                   equ 0002h
PRG1CON2_RG1ISET2_POSN                   equ 0002h
PRG1CON2_RG1ISET2_POSITION               equ 0002h
PRG1CON2_RG1ISET2_SIZE                   equ 0001h
PRG1CON2_RG1ISET2_LENGTH                 equ 0001h
PRG1CON2_RG1ISET2_MASK                   equ 0004h
PRG1CON2_RG1ISET3_POSN                   equ 0003h
PRG1CON2_RG1ISET3_POSITION               equ 0003h
PRG1CON2_RG1ISET3_SIZE                   equ 0001h
PRG1CON2_RG1ISET3_LENGTH                 equ 0001h
PRG1CON2_RG1ISET3_MASK                   equ 0008h
PRG1CON2_RG1ISET4_POSN                   equ 0004h
PRG1CON2_RG1ISET4_POSITION               equ 0004h
PRG1CON2_RG1ISET4_SIZE                   equ 0001h
PRG1CON2_RG1ISET4_LENGTH                 equ 0001h
PRG1CON2_RG1ISET4_MASK                   equ 0010h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 0D8Eh
// bitfield definitions
PWMEN_MPWM5EN_POSN                       equ 0004h
PWMEN_MPWM5EN_POSITION                   equ 0004h
PWMEN_MPWM5EN_SIZE                       equ 0001h
PWMEN_MPWM5EN_LENGTH                     equ 0001h
PWMEN_MPWM5EN_MASK                       equ 0010h

