GopalSaraf/Practicals/PSDL/include/proc/pic16f1765.inc
// Register: PWM5DCL
#define PWM5DCL PWM5DCL
PWM5DCL                                  equ 0D93h
// bitfield definitions
PWM5DCL_DC_POSN                          equ 0000h
PWM5DCL_DC_POSITION                      equ 0000h
PWM5DCL_DC_SIZE                          equ 0008h
PWM5DCL_DC_LENGTH                        equ 0008h
PWM5DCL_DC_MASK                          equ 00FFh
PWM5DCL_PWM5DCL0_POSN                    equ 0000h
PWM5DCL_PWM5DCL0_POSITION                equ 0000h
PWM5DCL_PWM5DCL0_SIZE                    equ 0001h
PWM5DCL_PWM5DCL0_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL0_MASK                    equ 0001h
PWM5DCL_PWM5DCL1_POSN                    equ 0001h
PWM5DCL_PWM5DCL1_POSITION                equ 0001h
PWM5DCL_PWM5DCL1_SIZE                    equ 0001h
PWM5DCL_PWM5DCL1_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL1_MASK                    equ 0002h
PWM5DCL_PWM5DCL2_POSN                    equ 0002h
PWM5DCL_PWM5DCL2_POSITION                equ 0002h
PWM5DCL_PWM5DCL2_SIZE                    equ 0001h
PWM5DCL_PWM5DCL2_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL2_MASK                    equ 0004h
PWM5DCL_PWM5DCL3_POSN                    equ 0003h
PWM5DCL_PWM5DCL3_POSITION                equ 0003h
PWM5DCL_PWM5DCL3_SIZE                    equ 0001h
PWM5DCL_PWM5DCL3_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL3_MASK                    equ 0008h
PWM5DCL_PWM5DCL4_POSN                    equ 0004h
PWM5DCL_PWM5DCL4_POSITION                equ 0004h
PWM5DCL_PWM5DCL4_SIZE                    equ 0001h
PWM5DCL_PWM5DCL4_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL4_MASK                    equ 0010h
PWM5DCL_PWM5DCL5_POSN                    equ 0005h
PWM5DCL_PWM5DCL5_POSITION                equ 0005h
PWM5DCL_PWM5DCL5_SIZE                    equ 0001h
PWM5DCL_PWM5DCL5_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL5_MASK                    equ 0020h
PWM5DCL_PWM5DCL6_POSN                    equ 0006h
PWM5DCL_PWM5DCL6_POSITION                equ 0006h
PWM5DCL_PWM5DCL6_SIZE                    equ 0001h
PWM5DCL_PWM5DCL6_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL6_MASK                    equ 0040h
PWM5DCL_PWM5DCL7_POSN                    equ 0007h
PWM5DCL_PWM5DCL7_POSITION                equ 0007h
PWM5DCL_PWM5DCL7_SIZE                    equ 0001h
PWM5DCL_PWM5DCL7_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL7_MASK                    equ 0080h
PWM5DCL_PWM5DCL_POSN                     equ 0000h
PWM5DCL_PWM5DCL_POSITION                 equ 0000h
PWM5DCL_PWM5DCL_SIZE                     equ 0008h
PWM5DCL_PWM5DCL_LENGTH                   equ 0008h
PWM5DCL_PWM5DCL_MASK                     equ 00FFh

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
PWM5DCH                                  equ 0D94h
// bitfield definitions
PWM5DCH_DC_POSN                          equ 0000h
PWM5DCH_DC_POSITION                      equ 0000h
PWM5DCH_DC_SIZE                          equ 0008h
PWM5DCH_DC_LENGTH                        equ 0008h
PWM5DCH_DC_MASK                          equ 00FFh
PWM5DCH_PWM5DCH0_POSN                    equ 0000h
PWM5DCH_PWM5DCH0_POSITION                equ 0000h
PWM5DCH_PWM5DCH0_SIZE                    equ 0001h
PWM5DCH_PWM5DCH0_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH0_MASK                    equ 0001h
PWM5DCH_PWM5DCH1_POSN                    equ 0001h
PWM5DCH_PWM5DCH1_POSITION                equ 0001h
PWM5DCH_PWM5DCH1_SIZE                    equ 0001h
PWM5DCH_PWM5DCH1_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH1_MASK                    equ 0002h
PWM5DCH_PWM5DCH2_POSN                    equ 0002h
PWM5DCH_PWM5DCH2_POSITION                equ 0002h
PWM5DCH_PWM5DCH2_SIZE                    equ 0001h
PWM5DCH_PWM5DCH2_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH2_MASK                    equ 0004h
PWM5DCH_PWM5DCH3_POSN                    equ 0003h
PWM5DCH_PWM5DCH3_POSITION                equ 0003h
PWM5DCH_PWM5DCH3_SIZE                    equ 0001h
PWM5DCH_PWM5DCH3_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH3_MASK                    equ 0008h
PWM5DCH_PWM5DCH4_POSN                    equ 0004h
PWM5DCH_PWM5DCH4_POSITION                equ 0004h
PWM5DCH_PWM5DCH4_SIZE                    equ 0001h
PWM5DCH_PWM5DCH4_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH4_MASK                    equ 0010h
PWM5DCH_PWM5DCH5_POSN                    equ 0005h
PWM5DCH_PWM5DCH5_POSITION                equ 0005h
PWM5DCH_PWM5DCH5_SIZE                    equ 0001h
PWM5DCH_PWM5DCH5_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH5_MASK                    equ 0020h
PWM5DCH_PWM5DCH6_POSN                    equ 0006h
PWM5DCH_PWM5DCH6_POSITION                equ 0006h
PWM5DCH_PWM5DCH6_SIZE                    equ 0001h
PWM5DCH_PWM5DCH6_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH6_MASK                    equ 0040h
PWM5DCH_PWM5DCH7_POSN                    equ 0007h
PWM5DCH_PWM5DCH7_POSITION                equ 0007h
PWM5DCH_PWM5DCH7_SIZE                    equ 0001h
PWM5DCH_PWM5DCH7_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH7_MASK                    equ 0080h
PWM5DCH_PWM5DCH_POSN                     equ 0000h
PWM5DCH_PWM5DCH_POSITION                 equ 0000h
PWM5DCH_PWM5DCH_SIZE                     equ 0008h
PWM5DCH_PWM5DCH_LENGTH                   equ 0008h
PWM5DCH_PWM5DCH_MASK                     equ 00FFh

// Register: PWM5PRL
#define PWM5PRL PWM5PRL
PWM5PRL                                  equ 0D95h
// bitfield definitions
PWM5PRL_PR_POSN                          equ 0000h
PWM5PRL_PR_POSITION                      equ 0000h
PWM5PRL_PR_SIZE                          equ 0008h
PWM5PRL_PR_LENGTH                        equ 0008h
PWM5PRL_PR_MASK                          equ 00FFh
PWM5PRL_PWM5PRL0_POSN                    equ 0000h
PWM5PRL_PWM5PRL0_POSITION                equ 0000h
PWM5PRL_PWM5PRL0_SIZE                    equ 0001h
PWM5PRL_PWM5PRL0_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL0_MASK                    equ 0001h
PWM5PRL_PWM5PRL1_POSN                    equ 0001h
PWM5PRL_PWM5PRL1_POSITION                equ 0001h
PWM5PRL_PWM5PRL1_SIZE                    equ 0001h
PWM5PRL_PWM5PRL1_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL1_MASK                    equ 0002h
PWM5PRL_PWM5PRL2_POSN                    equ 0002h
PWM5PRL_PWM5PRL2_POSITION                equ 0002h
PWM5PRL_PWM5PRL2_SIZE                    equ 0001h
PWM5PRL_PWM5PRL2_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL2_MASK                    equ 0004h
PWM5PRL_PWM5PRL3_POSN                    equ 0003h
PWM5PRL_PWM5PRL3_POSITION                equ 0003h
PWM5PRL_PWM5PRL3_SIZE                    equ 0001h
PWM5PRL_PWM5PRL3_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL3_MASK                    equ 0008h
PWM5PRL_PWM5PRL4_POSN                    equ 0004h
PWM5PRL_PWM5PRL4_POSITION                equ 0004h
PWM5PRL_PWM5PRL4_SIZE                    equ 0001h
PWM5PRL_PWM5PRL4_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL4_MASK                    equ 0010h
PWM5PRL_PWM5PRL5_POSN                    equ 0005h
PWM5PRL_PWM5PRL5_POSITION                equ 0005h
PWM5PRL_PWM5PRL5_SIZE                    equ 0001h
PWM5PRL_PWM5PRL5_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL5_MASK                    equ 0020h
PWM5PRL_PWM5PRL6_POSN                    equ 0006h
PWM5PRL_PWM5PRL6_POSITION                equ 0006h
PWM5PRL_PWM5PRL6_SIZE                    equ 0001h
PWM5PRL_PWM5PRL6_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL6_MASK                    equ 0040h
PWM5PRL_PWM5PRL7_POSN                    equ 0007h
PWM5PRL_PWM5PRL7_POSITION                equ 0007h
PWM5PRL_PWM5PRL7_SIZE                    equ 0001h
PWM5PRL_PWM5PRL7_LENGTH                  equ 0001h
PWM5PRL_PWM5PRL7_MASK                    equ 0080h
PWM5PRL_PWM5PRL_POSN                     equ 0000h
PWM5PRL_PWM5PRL_POSITION                 equ 0000h
PWM5PRL_PWM5PRL_SIZE                     equ 0008h
PWM5PRL_PWM5PRL_LENGTH                   equ 0008h
PWM5PRL_PWM5PRL_MASK                     equ 00FFh

// Register: PWM5PRH
#define PWM5PRH PWM5PRH
PWM5PRH                                  equ 0D96h
// bitfield definitions
PWM5PRH_PR_POSN                          equ 0000h
PWM5PRH_PR_POSITION                      equ 0000h
PWM5PRH_PR_SIZE                          equ 0008h
PWM5PRH_PR_LENGTH                        equ 0008h
PWM5PRH_PR_MASK                          equ 00FFh
PWM5PRH_PWM5PRH0_POSN                    equ 0000h
PWM5PRH_PWM5PRH0_POSITION                equ 0000h
PWM5PRH_PWM5PRH0_SIZE                    equ 0001h
PWM5PRH_PWM5PRH0_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH0_MASK                    equ 0001h
PWM5PRH_PWM5PRH1_POSN                    equ 0001h
PWM5PRH_PWM5PRH1_POSITION                equ 0001h
PWM5PRH_PWM5PRH1_SIZE                    equ 0001h
PWM5PRH_PWM5PRH1_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH1_MASK                    equ 0002h
PWM5PRH_PWM5PRH2_POSN                    equ 0002h
PWM5PRH_PWM5PRH2_POSITION                equ 0002h
PWM5PRH_PWM5PRH2_SIZE                    equ 0001h
PWM5PRH_PWM5PRH2_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH2_MASK                    equ 0004h
PWM5PRH_PWM5PRH3_POSN                    equ 0003h
PWM5PRH_PWM5PRH3_POSITION                equ 0003h
PWM5PRH_PWM5PRH3_SIZE                    equ 0001h
PWM5PRH_PWM5PRH3_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH3_MASK                    equ 0008h
PWM5PRH_PWM5PRH4_POSN                    equ 0004h
PWM5PRH_PWM5PRH4_POSITION                equ 0004h
PWM5PRH_PWM5PRH4_SIZE                    equ 0001h
PWM5PRH_PWM5PRH4_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH4_MASK                    equ 0010h
PWM5PRH_PWM5PRH5_POSN                    equ 0005h
PWM5PRH_PWM5PRH5_POSITION                equ 0005h
PWM5PRH_PWM5PRH5_SIZE                    equ 0001h
PWM5PRH_PWM5PRH5_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH5_MASK                    equ 0020h
PWM5PRH_PWM5PRH6_POSN                    equ 0006h
PWM5PRH_PWM5PRH6_POSITION                equ 0006h
PWM5PRH_PWM5PRH6_SIZE                    equ 0001h
PWM5PRH_PWM5PRH6_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH6_MASK                    equ 0040h
PWM5PRH_PWM5PRH7_POSN                    equ 0007h
PWM5PRH_PWM5PRH7_POSITION                equ 0007h
PWM5PRH_PWM5PRH7_SIZE                    equ 0001h
PWM5PRH_PWM5PRH7_LENGTH                  equ 0001h
PWM5PRH_PWM5PRH7_MASK                    equ 0080h
PWM5PRH_PWM5PRH_POSN                     equ 0000h
PWM5PRH_PWM5PRH_POSITION                 equ 0000h
PWM5PRH_PWM5PRH_SIZE                     equ 0008h
PWM5PRH_PWM5PRH_LENGTH                   equ 0008h
PWM5PRH_PWM5PRH_MASK                     equ 00FFh

