GopalSaraf/Practicals/PSDL/include/proc/pic16f1765.inc
// Register: PWM5CLKCON
#define PWM5CLKCON PWM5CLKCON
PWM5CLKCON                               equ 0D9Eh
// bitfield definitions
PWM5CLKCON_CS_POSN                       equ 0000h
PWM5CLKCON_CS_POSITION                   equ 0000h
PWM5CLKCON_CS_SIZE                       equ 0002h
PWM5CLKCON_CS_LENGTH                     equ 0002h
PWM5CLKCON_CS_MASK                       equ 0003h
PWM5CLKCON_PS_POSN                       equ 0004h
PWM5CLKCON_PS_POSITION                   equ 0004h
PWM5CLKCON_PS_SIZE                       equ 0003h
PWM5CLKCON_PS_LENGTH                     equ 0003h
PWM5CLKCON_PS_MASK                       equ 0070h
PWM5CLKCON_PWM5CS0_POSN                  equ 0000h
PWM5CLKCON_PWM5CS0_POSITION              equ 0000h
PWM5CLKCON_PWM5CS0_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS0_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS0_MASK                  equ 0001h
PWM5CLKCON_PWM5CS1_POSN                  equ 0001h
PWM5CLKCON_PWM5CS1_POSITION              equ 0001h
PWM5CLKCON_PWM5CS1_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS1_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS1_MASK                  equ 0002h
PWM5CLKCON_PWM5CS2_POSN                  equ 0002h
PWM5CLKCON_PWM5CS2_POSITION              equ 0002h
PWM5CLKCON_PWM5CS2_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS2_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS2_MASK                  equ 0004h
PWM5CLKCON_PWM5PS0_POSN                  equ 0004h
PWM5CLKCON_PWM5PS0_POSITION              equ 0004h
PWM5CLKCON_PWM5PS0_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS0_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS0_MASK                  equ 0010h
PWM5CLKCON_PWM5PS1_POSN                  equ 0005h
PWM5CLKCON_PWM5PS1_POSITION              equ 0005h
PWM5CLKCON_PWM5PS1_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS1_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS1_MASK                  equ 0020h
PWM5CLKCON_PWM5PS2_POSN                  equ 0006h
PWM5CLKCON_PWM5PS2_POSITION              equ 0006h
PWM5CLKCON_PWM5PS2_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS2_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS2_MASK                  equ 0040h
PWM5CLKCON_PWM5CS_POSN                   equ 0000h
PWM5CLKCON_PWM5CS_POSITION               equ 0000h
PWM5CLKCON_PWM5CS_SIZE                   equ 0003h
PWM5CLKCON_PWM5CS_LENGTH                 equ 0003h
PWM5CLKCON_PWM5CS_MASK                   equ 0007h
PWM5CLKCON_PWM5PS_POSN                   equ 0004h
PWM5CLKCON_PWM5PS_POSITION               equ 0004h
PWM5CLKCON_PWM5PS_SIZE                   equ 0003h
PWM5CLKCON_PWM5PS_LENGTH                 equ 0003h
PWM5CLKCON_PWM5PS_MASK                   equ 0070h
PWM5CLKCON_CS0_POSN                      equ 0000h
PWM5CLKCON_CS0_POSITION                  equ 0000h
PWM5CLKCON_CS0_SIZE                      equ 0001h
PWM5CLKCON_CS0_LENGTH                    equ 0001h
PWM5CLKCON_CS0_MASK                      equ 0001h
PWM5CLKCON_CS1_POSN                      equ 0001h
PWM5CLKCON_CS1_POSITION                  equ 0001h
PWM5CLKCON_CS1_SIZE                      equ 0001h
PWM5CLKCON_CS1_LENGTH                    equ 0001h
PWM5CLKCON_CS1_MASK                      equ 0002h
PWM5CLKCON_CS2_POSN                      equ 0002h
PWM5CLKCON_CS2_POSITION                  equ 0002h
PWM5CLKCON_CS2_SIZE                      equ 0001h
PWM5CLKCON_CS2_LENGTH                    equ 0001h
PWM5CLKCON_CS2_MASK                      equ 0004h
PWM5CLKCON_PS0_POSN                      equ 0004h
PWM5CLKCON_PS0_POSITION                  equ 0004h
PWM5CLKCON_PS0_SIZE                      equ 0001h
PWM5CLKCON_PS0_LENGTH                    equ 0001h
PWM5CLKCON_PS0_MASK                      equ 0010h
PWM5CLKCON_PS1_POSN                      equ 0005h
PWM5CLKCON_PS1_POSITION                  equ 0005h
PWM5CLKCON_PS1_SIZE                      equ 0001h
PWM5CLKCON_PS1_LENGTH                    equ 0001h
PWM5CLKCON_PS1_MASK                      equ 0020h
PWM5CLKCON_PS2_POSN                      equ 0006h
PWM5CLKCON_PS2_POSITION                  equ 0006h
PWM5CLKCON_PS2_SIZE                      equ 0001h
PWM5CLKCON_PS2_LENGTH                    equ 0001h
PWM5CLKCON_PS2_MASK                      equ 0040h

// Register: PWM5LDCON
#define PWM5LDCON PWM5LDCON
PWM5LDCON                                equ 0D9Fh
// bitfield definitions
PWM5LDCON_LDA_POSN                       equ 0007h
PWM5LDCON_LDA_POSITION                   equ 0007h
PWM5LDCON_LDA_SIZE                       equ 0001h
PWM5LDCON_LDA_LENGTH                     equ 0001h
PWM5LDCON_LDA_MASK                       equ 0080h
PWM5LDCON_PWM5LD_POSN                    equ 0007h
PWM5LDCON_PWM5LD_POSITION                equ 0007h
PWM5LDCON_PWM5LD_SIZE                    equ 0001h
PWM5LDCON_PWM5LD_LENGTH                  equ 0001h
PWM5LDCON_PWM5LD_MASK                    equ 0080h

// Register: PWM5OFCON
#define PWM5OFCON PWM5OFCON
PWM5OFCON                                equ 0DA0h
// bitfield definitions
PWM5OFCON_OFO_POSN                       equ 0004h
PWM5OFCON_OFO_POSITION                   equ 0004h
PWM5OFCON_OFO_SIZE                       equ 0001h
PWM5OFCON_OFO_LENGTH                     equ 0001h
PWM5OFCON_OFO_MASK                       equ 0010h
PWM5OFCON_PWM5OFMC_POSN                  equ 0004h
PWM5OFCON_PWM5OFMC_POSITION              equ 0004h
PWM5OFCON_PWM5OFMC_SIZE                  equ 0001h
PWM5OFCON_PWM5OFMC_LENGTH                equ 0001h
PWM5OFCON_PWM5OFMC_MASK                  equ 0010h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0E0Fh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INTPPS
#define INTPPS INTPPS
INTPPS                                   equ 0E10h
// bitfield definitions
INTPPS_INTPPS_POSN                       equ 0000h
INTPPS_INTPPS_POSITION                   equ 0000h
INTPPS_INTPPS_SIZE                       equ 0005h
INTPPS_INTPPS_LENGTH                     equ 0005h
INTPPS_INTPPS_MASK                       equ 001Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0E11h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0E12h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0E13h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E14h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
COG1INPPS                                equ 0E16h
// bitfield definitions
COG1INPPS_COG1INPPS_POSN                 equ 0000h
COG1INPPS_COG1INPPS_POSITION             equ 0000h
COG1INPPS_COG1INPPS_SIZE                 equ 0005h
COG1INPPS_COG1INPPS_LENGTH               equ 0005h
COG1INPPS_COG1INPPS_MASK                 equ 001Fh

