GopalSaraf/Practicals/PSDL/include/proc/pic16f1765.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0E19h
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0E1Ah
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0005h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0005h
T3CKIPPS_T3CKIPPS_MASK                   equ 001Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0E1Bh
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0005h
T3GPPS_T3GPPS_LENGTH                     equ 0005h
T3GPPS_T3GPPS_MASK                       equ 001Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0E1Ch
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 0E1Dh
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0005h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0005h
T5CKIPPS_T5CKIPPS_MASK                   equ 001Fh

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 0E1Eh
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0005h
T5GPPS_T5GPPS_LENGTH                     equ 0005h
T5GPPS_T5GPPS_MASK                       equ 001Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 0E1Fh
// bitfield definitions
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0005h
T6INPPS_T6INPPS_LENGTH                   equ 0005h
T6INPPS_T6INPPS_MASK                     equ 001Fh

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
SSPCLKPPS                                equ 0E20h
// bitfield definitions
SSPCLKPPS_SSPCLKPPS_POSN                 equ 0000h
SSPCLKPPS_SSPCLKPPS_POSITION             equ 0000h
SSPCLKPPS_SSPCLKPPS_SIZE                 equ 0005h
SSPCLKPPS_SSPCLKPPS_LENGTH               equ 0005h
SSPCLKPPS_SSPCLKPPS_MASK                 equ 001Fh

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
SSPDATPPS                                equ 0E21h
// bitfield definitions
SSPDATPPS_SSPDATPPS_POSN                 equ 0000h
SSPDATPPS_SSPDATPPS_POSITION             equ 0000h
SSPDATPPS_SSPDATPPS_SIZE                 equ 0005h
SSPDATPPS_SSPDATPPS_LENGTH               equ 0005h
SSPDATPPS_SSPDATPPS_MASK                 equ 001Fh

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
SSPSSPPS                                 equ 0E22h
// bitfield definitions
SSPSSPPS_SSPSSPPS_POSN                   equ 0000h
SSPSSPPS_SSPSSPPS_POSITION               equ 0000h
SSPSSPPS_SSPSSPPS_SIZE                   equ 0005h
SSPSSPPS_SSPSSPPS_LENGTH                 equ 0005h
SSPSSPPS_SSPSSPPS_MASK                   equ 001Fh

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E24h
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0005h
RXPPS_RXPPS_LENGTH                       equ 0005h
RXPPS_RXPPS_MASK                         equ 001Fh

// Register: CKPPS
#define CKPPS CKPPS
CKPPS                                    equ 0E25h
// bitfield definitions
CKPPS_CKPPS_POSN                         equ 0000h
CKPPS_CKPPS_POSITION                     equ 0000h
CKPPS_CKPPS_SIZE                         equ 0005h
CKPPS_CKPPS_LENGTH                       equ 0005h
CKPPS_CKPPS_MASK                         equ 001Fh

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0E28h
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0005h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0005h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 001Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0E29h
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0005h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0005h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 001Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0E2Ah
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0005h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0005h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 001Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0E2Bh
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0005h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0005h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 001Fh

// Register: PRG1RPPS
#define PRG1RPPS PRG1RPPS
PRG1RPPS                                 equ 0E2Ch
// bitfield definitions
PRG1RPPS_PRG1RPPS_POSN                   equ 0000h
PRG1RPPS_PRG1RPPS_POSITION               equ 0000h
PRG1RPPS_PRG1RPPS_SIZE                   equ 0005h
PRG1RPPS_PRG1RPPS_LENGTH                 equ 0005h
PRG1RPPS_PRG1RPPS_MASK                   equ 001Fh

// Register: PRG1FPPS
#define PRG1FPPS PRG1FPPS
PRG1FPPS                                 equ 0E2Dh
// bitfield definitions
PRG1FPPS_PRG1FPPS_POSN                   equ 0000h
PRG1FPPS_PRG1FPPS_POSITION               equ 0000h
PRG1FPPS_PRG1FPPS_SIZE                   equ 0005h
PRG1FPPS_PRG1FPPS_LENGTH                 equ 0005h
PRG1FPPS_PRG1FPPS_MASK                   equ 001Fh

// Register: MD1CHPPS
#define MD1CHPPS MD1CHPPS
MD1CHPPS                                 equ 0E30h
// bitfield definitions
MD1CHPPS_MD1CHPPS_POSN                   equ 0000h
MD1CHPPS_MD1CHPPS_POSITION               equ 0000h
MD1CHPPS_MD1CHPPS_SIZE                   equ 0005h
MD1CHPPS_MD1CHPPS_LENGTH                 equ 0005h
MD1CHPPS_MD1CHPPS_MASK                   equ 001Fh

